Repository: xbmc/vfs.rar
Catalog: vfs.rar/resources/language/resource.language.*/strings.po
Languages: da_dk, fr_fr, id_id, pl_pl, ru_ru, sv_se

# Addon Summary
source: Unarchiver for .rar files
fr_fr: Désarchiveur pour les fichiers .rar
id_id: Pembuka berkas .rar
pl_pl: Ekstraktor plików .rar
ru_ru: Распаковщик для архивов .rar
sv_se: Uppackare för .rar-filer

# Addon Description
source: This addon is an extraction utility for RAR archives.[CR][CR]It allows direct reading of uncompressed RAR files, so prior unpacking is not necessary. For all other types, it is temporarily unpacked and passed to Kodi.[CR][CR]Attention: A "Solid RAR" archive type requires complete unpacking to use files within it. Hence access times may be long for larger packages.
fr_fr: Cet addon est un utilitaire d'extraction d'archives RAR.[CR][CR]Il permet la lecture directe des fichiers RAR non compressés, de sorte qu'un décompactage préalable n'est pas nécessaire. Pour tous les autres types, il est temporairement décompressé et transmis à Kodi.[CR][CR]Attention : Un type d'archive "Solid RAR" nécessite une décompression complète pour utiliser les fichiers qu'il contient. Par conséquent, les temps d'accès peuvent être longs pour les packages plus volumineux.
id_id: Pengaya ini adalah alat ekstrasi untuk arsip RAR.[CR][CR]Ini memungkinkan pembacaan langsung dari berkas RAR yang tidak terkompresi, jadi tidak memerlukan pembukaan. Untuk semua jenis lain, berkasnya dibuka secara sementara dan disediakan ke Kodi.[CR][CR]Perignatan: Sebuah jenis arsip "Solid RAR" memerlukan pembukaan lengkap untuk menggunakan berkas-berkas di dalamnya. Waktu pengaksesan dapat memakan waktu panjang untuk paket yang lebih besar.
pl_pl: Ten dodatek jest narzędziem do ekstrakcji archiwów RAR.[CR][CR]Pozwala na bezpośredni odczyt nieskompresowanych plików RAR, więc wcześniejsze rozpakowanie nie jest konieczne. W przypadku wszystkich innych typów są one tymczasowo rozpakowywane i przekazywane do Kodi.[CR][CR]Uwaga: typ archiwum „Ciągły RAR” wymaga całkowitego rozpakowania, aby móc korzystać z zawartych w nim plików. Z tego powodu czasy dostępu mogą być długie w przypadku większych pakietów.
ru_ru: Это дополнение представляет собой утилиту для работы с архивами RAR.[CR][CR]Оно позволяет напрямую читать несжатые файлы RAR, поэтому предварительная распаковка не требуется. Для всех остальных типов архив временно распаковывается и данные передаются в Kodi.[CR][CR]Внимание: Тип архива "Непрерывный" требует полной распаковки для использования файлов из него. Поэтому для больших пакетов время доступа увеличится.
sv_se: Detta tillägg är ett uppackningsverktyg för RAR-arkiv.[CR][CR]Detta gör det möjligt att spela upp okomprimerade RAR-filer utan att de först packas upp. För alla andra typer, packas den upp tillfälligt och skickas sedan till Kodi.[CR][CR]Observera: Ett "Fast" arkiv kräver en komplett uppackning av arkivet. Därför kan uppstartstiden ta lång tid om det är ett stort arkiv.

# #30000
source: RAR file extract
da_dk: RAR filekstrakt
fr_fr: Extrait de fichier RAR
id_id: Ekstrak berkas RAR
pl_pl: Wypakowanie pliku RAR
ru_ru: Распаковка RAR-файла
sv_se: Extrahera RAR-fil

# #30001
source: RAR file scan
da_dk: RAR filskanning
fr_fr: Analyse des fichiers RAR
id_id: Pemindaian berkas RAR
pl_pl: Skanowanie pliku RAR
ru_ru: Сканирование RAR-файла
sv_se: Genomsökning av RAR-fil

# #30002
source: RAR solid file scan
da_dk: RAR solid filskanning
fr_fr: Analyse de fichier solide RAR
id_id: Pemindaian berkas solid RAR
pl_pl: Skanowanie pliku ciągłego RAR
ru_ru: Сканирование непрерывного RAR-файла
sv_se: Genomsökning av solid RAR-fil

# #30003
source: Enter RAR package password for: %s
fr_fr: Entrez le mot de passe du package RAR pour: %s
id_id: Masukkan kata sandi paket RAR untuk: %s
pl_pl: Wprowadź hasło pakietu RAR dla: %s
ru_ru: Введите пароль архива RAR для: %s
sv_se: Ange lösenordet för RAR-arkivet: %s

# #30004
source: Not enough disk space available
da_dk: Ikke nok diskplads tilgængelig
fr_fr: Pas assez d'espace disque disponible
id_id: Ruang diska tidak cukup
pl_pl: Za mało dostępnego miejsca na dysku
ru_ru: Недостаточно свободного места на диске
sv_se: Inte tillräckligt med ledigt diskutrymme

# #30010
source: General
da_dk: Generel
fr_fr: Général
id_id: Umum
pl_pl: Ogólne
ru_ru: Общий
sv_se: Allmänt

# #30011
source: Ask for password
da_dk: Spørg efter kodeord
fr_fr: Demander un mot de passe
id_id: Tanyakan kata sandi
pl_pl: Pytaj o hasło
ru_ru: Введите пароль
sv_se: Fråga efter lösenord

# #30012
source: If archives are password protected, prompt for the password to be entered
fr_fr: Si les archives sont protégées par un mot de passe, demander le mot de passe à saisir
id_id: Jika arsip dilindungi oleh kata sandi, minta kata sandi untuk dimasukkan
pl_pl: Jeśli archiwa są chronione hasłem, poproś o podanie hasła
ru_ru: Если архивы защищены паролем — запросить ввод пароля
sv_se: Om arkivet är lösenordsskyddat, fråga efter lösenordet

# #30013
source: Pre-defined password to attempt decompression with
fr_fr: Mot de passe prédéfini pour tenter la décompression avec
id_id: Kata sandi yang dipradefinisikan untuk mencoba dekompresi
pl_pl: Wstępnie zdefiniowane hasło do próby dekompresji
ru_ru: Предварительно заданный пароль для попытки распаковки с помощью
sv_se: Fördefinierade lösenord att använda vid uppackning

# #30014
source: Stored password 1
da_dk: Gemt kodeord 1
fr_fr: Mot de passe enregistré 1
id_id: Kata sandi yang tersimpan 1
pl_pl: Zapisane hasło 1
ru_ru: Сохраненный пароль 1
sv_se: Sparat lösenord 1

# #30015
source: Stored password 2
da_dk: Gemt kodeord 2
fr_fr: Mot de passe enregistré 2
id_id: Kata sandi yang tersimpan 2
pl_pl: Zapisane hasło 2
ru_ru: Сохранённый пароль 1
sv_se: Sparat lösenord 2

# #30016
source: Stored password 3
da_dk: Gemt kodeord 3
fr_fr: Mot de passe enregistré 3
id_id: Kata sandi yang tersimpan 3
pl_pl: Zapisane hasło 3
ru_ru: Сохранённый пароль 3
sv_se: Sparat lösenord 3

# #30017
source: Stored password 4
da_dk: Gemt kodeord 4
fr_fr: Mot de passe enregistré 4
id_id: Kata sandi yang tersimpan 4
pl_pl: Zapisane hasło 4
ru_ru: Сохранённый пароль 4
sv_se: Sparat lösenord 4

# #30018
source: Stored password 5
da_dk: Gemt kodeord 5
fr_fr: Mot de passe enregistré 5
id_id: Kata sandi yang tersimpan 5
pl_pl: Zapisane hasło 5
ru_ru: Сохранённый пароль 5
sv_se: Sparat lösenord 5

# #30019
source: Confirm copy
da_dk: Bekræft kopiering
fr_fr: Confirmer la copie
id_id: Konfirmasi penyalinan
pl_pl: Potwierdź kopiowanie
ru_ru: Подтвердить
sv_se: Bekräfta kopieringen

# #30020
source: Need to unpack a big file. Continue?
da_dk: Kræver udpakning af stor fil. Fortsæt?
fr_fr: Besoin de décompresser un gros fichier. Continuer?
id_id: Perlu membuka berkas besar. Lanjut?
pl_pl: Trzeba rozpakować duży plik. Kontynuować?
ru_ru: Необходимо распаковать большой файл. Продолжить?
sv_se: En stor fil behöver packas upp. Fortsätta?

# #30021
source: Not enough memory available to decompress file
da_dk: Ikke nok tilgængelig hukommelse til at dekomprimere filen
fr_fr: Pas assez de mémoire disponible pour décompresser le fichier
id_id: Memori tidak cukup untuk mendekrompresi berkas
pl_pl: Za mało dostępnej pamięci do zdekompresowania pliku
ru_ru: Недостаточно памяти для распаковки файла
sv_se: Det finns inte tillräckligt med minne för att packa upp filen

# #30022
source: Passwords
da_dk: Kodeord
fr_fr: Mots de passe
id_id: Kata sandi
pl_pl: Hasła
ru_ru: Пароли
sv_se: Lösenord

# #30023
source: Asks to unpack
da_dk: Spørg om at pakke ud
fr_fr: Demande de décompression
id_id: Meminta untuk membuka
pl_pl: Prosi o rozpakowanie
ru_ru: Запрос на распаковку
sv_se: Frågar dig om du vill packa upp filen

# #30024
source: Asks you with a dialog to confirm the unpacking of a larger file.
fr_fr: Vous demande avec une boîte de dialogue de confirmer la décompression d'un fichier plus volumineux.
id_id: Meminta Anda dengan dialog untuk mengonfirmasi pembukaan berkas yang lebih besar.
pl_pl: Pojawia się okno dialogowe potwierdzające rozpakowanie większego pliku.
ru_ru: Запрашивает в диалоговом окне подтверждение распаковки файла большего размера.
sv_se: Visar en dialogruta där du måste bekräfta uppackningen av stora filer.
